app/Controllers/AdminPortfolioController.php

    public function index()
    {
        $model = new PortfolioModel();
        $data['portfolios'] = $model->findAll();
---
SELECT *
FROM `portfolios`