app/Controllers/BerandaController.php

    public function index()
    {
        $data = [
            'portfolios' => $this->portfolioModel->findAll(),
            'heroSections' => $this->heroSectionModel->findAll(),
            'contactInfo' => $this->contactModel->findAll(),
            'about' => $this->aboutModel->findAll(),
            'paket' => $this->paketModel->findAll(),
            'clients' => $this->clientModel->findAll(),
            'services' => $this->serviceModel->findAll()
        ];
---
SELECT *
FROM `portfolios`
SELECT *
FROM `hero_section`
SELECT *
FROM `contacts`
SELECT *
FROM `about`
SELECT *
FROM `pakets`
SELECT *
FROM `clients`
SELECT *
FROM `services`