app/Controllers/ServiceController.php

SELECT *
FROM `services`
---
    public function index()
    {
        $data['services'] = $this->serviceModel->findAll();

SELECT *
FROM `services`
WHERE `services`.`id` = '1'
---
    public function edit($id)
    {
        $data['service'] = $this->serviceModel->find($id);