app/Models/PortfolioModel.php

SELECT *
FROM `portfolios`
---
    public function getPortfolios()
    {
        return $this->findAll(); // Mengambil semua data dari tabel portfolios